Repository: andreaulicna/42_ft_transcendence
Catalog: authentication/locale/*/LC_MESSAGES/django.po
Languages: cs, sk

source: Invalid or expired OTP
cs: Jednorázové heslo je neplatné

source: CSRF token missing
cs: Chybí CSRF token
sk: Chýba CSRF token

source: OTP is yet to be provided
cs: Je třeba poskytnout jednorázové heslo
sk: Je potrebné poskytnúť jednorázové heslo

source: This account is not active
cs: Tento účet není aktivní
sk: Tento účet nie je aktívny

source: State not tied to user
cs: Stav se nepodařilo spojit s uživatelem
sk: Stav sa nepodarilo spojit s používateľom

source: Invalid username provided
cs: Neplatné uživatelské jméno
sk: Neplatné prihlasovacie meno

source: Request timed out, log in again
cs: Požadavek vypršel, znovu se přihlaš
sk: Požiadavka vypršala, znovu sa prihlás

source: Invalid username or password
cs: Neplatné přihlašovací údaje
sk: Neplatné prihlasovacie údaje

source: Logging out when in game is not possible
cs: Během hry se nelze odhlásit
sk: Počas hry sa nedá odhlásit

source: Successfully logged out
cs: Odhlášení proběhlo úspěšně
sk: Odlasenie prebehlo úspešne

source: Already logged out
cs: Uživatel již odhlášen
sk: Používateľ je už odhlásený

source: Invalid state parameter, try again
cs: Neplatný stav, zkus to znovu
sk: Neplatný stav, skús znovu

source: Code was not provided by 42 OAuth
cs: Aplikace neobdržela přístupový kód ze strany 42 OAuth
sk: Aplikácie neobdržala prístupový kód zo strany 42 OAuth

source: Token was not provided by 42 OAuth
cs: Aplikace neobdržela přístupový token ze strany 42 OAuth
sk: Aplikácie neobdržala prístupový token zo strany 42 OAuth

source: Token provided by 42 OAuth is invalid or has expired
cs: Token poskutnutý 42 OAuth je neplatný
sk: Token poskytnutý 42 OAuth je neplatný

source: Intra account does not have a valid e-mail address associated with it
cs: K intra účtu není přirazena platná e-mailová adresa
sk: K intra účtu nie je priradené platná e-mailová adresa

source: English
cs: Angličtina
sk: Angličtina

source: Czech
cs: Čeština
sk: Čeština

source: Slovak
cs: Slovenština
sk: Slovenčina
