Repository: andreaulicna/42_ft_transcendence
Catalog: tournament/locale/*/LC_MESSAGES/django.po
Languages: cs, sk

source: CSRF token missing
cs: Chbybí CSRF token
sk: Chýba CSRF token

source: Player already has a match in progress.
cs: Hráč má již rozehraný jiný zápas
sk: Hráč už hrá iný zápas

source: You are already in a waiting tournament, you cannot create another one!
cs: Není možné vytvořit nový turnaj během čekání na spuštění jiného!
sk: Nie je možné vytvoriť nový turnaj počas čakania na spustenie iného!

source: You are already in a tournament and have matches to play, you cannot create another one!
cs: Není možné vytvořit nový turnaj během hraní jiného!
sk: Nie je možné vytvoriť nový turnaj počas hrania iného!

source: Player does not exist
cs: Hráč neexistuje
sk: Hráč neexistuje

source: Tournament created.
cs: Turnaj vytvořen
sk: Turnaj vytvorený

source: You are alredy in a waiting tournament, you cannot join another one!
cs: Není možné vytvořit nový turnaj během čekání na spuštění jiného!
sk: Nie je možné vytvoriť nový turnaj počas čakania na spustenie iného!

source: You are already in a tournament and have matches to play!
cs: Už hraješ v jiném turnaji!
sk: Už hráš v inom turnaji!

source: No such tournament exists!
cs: Turnaj neexistuje
sk: Turnaj neexistuje

source: This tournament is already full!
cs: Turnaj má plnou kapacitu!
sk: Turnaj má plnú kapacitu!

source: Added you to the tournament!.
cs: Byl jsi přidán do turnaje!
sk: Bol si pridaný do turnaja!

source: This tournament is already in progress, you cannot cancel joining!
cs: Turnaj už běží, nelze zrušit registraci
sk: Turnaj už beží, nie je možné zrušit registráciu

source: This tournament has already finished, you cannot cancel joining!
cs: Turnaj už se dohrál, nelze zrušit registraci
sk: Turnaj sa už dohral, nie je možné zrušiť registráciu

source: You have successfully canceled joining the tournament.
cs: Úspěšné odhlášení z turnaje
sk: Úspešne odhlásenie z turnaja

source: You are not part of this tournament.
cs: Nejsi součástí tohoto turnaje
sk: Nie si súčasťou tohto turnaja

source: Wrong number of players for the tournament capacity
cs: Špatná hodnota udávající kapacitu turnaje
sk: Nesprávna hodnota udávajúca kapacitu turnaja

source: You are already playing a local tournament, you cannot create another one!
cs: Už hraješ v jiném místním turnaji!
sk: Nie je možné vytvoriť nový miestny turnaj počas hrania iného!

source: Local tournament created.
cs: Místní turnaj vytvořen
sk: Miestny turnaj vytvorený

source: English
cs: Angličtina
sk: Angličtina

source: Czech
cs: Čeština
sk: Čeština

source: Slovak
cs: Slovenština
sk: Slovenčina
