Repository: andreaulicna/42_ft_transcendence
Catalog: user_management/locale/*/LC_MESSAGES/django.po
Languages: cs, sk

source: Username is too short
cs: Uživatelské jméno je příliš dlouhé

source: Username is too long
cs: Uživatelské jméno je příliš krátké

source: CSRF token missing
cs: Chybí CSRF token
sk: Chýba CSRF token

source: OTP not provided
cs: Chybí jednorázové heslo
sk: Chýba jednorázové heslo

source: Secret has not been generated yet
cs: Dvoufázové ověření nemá aktivní kód
sk: Dvojfázové overenie nemá aktívny kód

source: 2FA enabled
cs: Dvoufázové ověření aktivováno
sk: Dvojfázové overenie aktivované

source: Invalid OTP
cs: Neplatné jednorázové heslo
sk: Neplatné jednorázové heslo

source: 2FA disabled
cs: Dvoufázové ověření deaktivováno
sk: Dvojfázové overenie deaktivované

source: 2FA has not been enabled
cs: Dvoufázové ověření nebylo aktivováno
sk: Dvojfázové overenie nebolo aktivované

source: Player does not exist
cs: Hráč neexistuje
sk: Hráč neexistuje

source: Please choose a username different to your current one
cs: Zvol si uživatelské jméno, které se liší od současného
sk: Zvoľ si použivateľské meno, ktoré sa líši od tvojho súčasného

source: Username must consist of 3-20 characters
cs: Uživatelské jméno musí obsahovat 3-20 znaků
sk: Používateľské meno musí obsahovať 3-20 znakov

source: Username already exists, choose a different one
cs: Uživatelské jméno už existuje, vyber si jiné
sk: Používateľské meno už existuje, vyber si iné

source: User info updated
cs: Informace o uživateli aktualizovány
sk: Informácie o používateľovi aktualizované

source: Other user not found
cs: Uživatel nebyl nalezen
sk: Používateľ sa nenašiel

source: No avatar data provided
cs: Nahrávaný avatar je prázdný
sk: Nahraný avatar je prázdny

source: Avatar updated successfully
cs: Avatar byl úspěšně nahrán
sk: Avatar bol úspešne nahraný

source: Avatar upload failed
cs: Nepodařilo se nahrát avatar
sk: Nepodarilo sa nahrať avatar

source: Match not found
cs: Zápas nebyl nalezen
sk: Zápas sa nenašiel

source: Receiver's username not specified
cs: Uživatelské jméno příjemce není uvedeno
sk: Používateľské meno príjemncu nie je uvedené

source: You cannot befriend yourself
cs: Nelze přidat sebe samého jako přítele
sk: Nie je možné pridať seba samého ako priateľa

source: User not found
cs: Uživatel nenalezen
sk: Používateľ sa nenašiel

source: Friendship (request) already exists.
cs: (Žádost o) přátelství už existuje.
sk: (Žiadosť o) priateľstvo už existuje.

source: Friendship request sent successfully.
cs: Žádost o přátelství úspěšně odeslána.
sk: Žiadosť o priateľstvo úspešne odoslaná.

source: Friendship request accepted successfully.
cs: Žádost o přátelství úspěšně přijata.
sk: Žiadosť o priateľstvo úspešne prijatá.

source: Friendship request not found.
cs: Žádost o přítelství nebyla nalezena.
sk: Žiadosť o priateľstvo sa nenašla.

source: Friendship request deleted successfully.
cs: Žádost o přítelství úspěšně odstraněna.
sk: Žiadosť o priateľstvo úspešne odstránená.

source: Friendship (request) deleted successfully.
cs: (Žádost o) přátelství úspěšně odstraněna.
sk: (Žiadosť o ) priateľstvo úspešne odstránená.

source: Friendship not found.
cs: Záznam o přátelství nebyl nalezen.
sk: Záznam o priateľstve sa nenašiel.

source: English
cs: Angličtina
sk: Angličtina

source: Czech
cs: Čeština
sk: Čeština

source: Slovak
cs: Slovenština
sk: Slovenčina
